{"loss": "categorical_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 376, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 376]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 280, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 280]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 600, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 600]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_8"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 1576, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 1576]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_9"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 5472, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 5472]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_11"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_12"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 6744, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 6744]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_13"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_14"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_15", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 344, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 344]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_15"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_16", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_16"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_17", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_17"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_18", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_18"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_19", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 56, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 56]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_19"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_20", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_20"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_21", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_21"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_22", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_22"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_23", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_23"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_24"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_25", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 32, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 32]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_25"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_26", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_26"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_27", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_27"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_28", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_28"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_29", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 624, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 624]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_29"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_30", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_30"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_31", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 960, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 960]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_31"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_32", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_32"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_32"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_33", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_33"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_33"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_34", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_34"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_34"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_35", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 24]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_35"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_36", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_36"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_37", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 48, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 48]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_37"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_37"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_38", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_38"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_38"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_39", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 40]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_39"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_39"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_40", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_40"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_40"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_41", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 32, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 32]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_41"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_41"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_42", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_42"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_42"}}]}], "name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_43", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 17}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_43"}}], "sample_weight_mode": null}